CF/Enums/ВидПлатежа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидПлатежа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предоплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсрочкаПлатежа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Enums/ФормыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ФормыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Взаимозачет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Documents/СчетФактураПолученный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>СчетФактураПолученный</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исправление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетФактураОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученВЭлектронномВиде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчетаФактуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПолученныхСчетовФактур</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоставления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CF/CommonModules/ЗакупкиКлиент/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ТАБЛИЧНОЙ ЧАСТИ ЭТАПЫ ОПЛАТ

// Процедура формирует строку ТЧ ЭтапыОплаты,
// стандартная обработка игнорируется через параметр Отказ.
Процедура ДобавитьЭтапОплаты(Объект, Элементы, СуммаЗаказа, ДокументПоступленияСуществует, Отказ, Копирование = Ложь, ЗапрашиватьДатуПлатежа = Истина) Экспорт
	
	СуммаОплаты = Объект.ЭтапыОплат.Итог("Сумма");
	
	ЭтоЗаказПоставщику = ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику");
	
	Если СуммаОплаты > СуммаЗаказа Тогда
		
		Если ДокументПоступленияСуществует Тогда
			
			ТекстОшибки = НСтр("ru = 'Добавление платежа не требуется
			|сумма оплат %СуммаОплаты% превышает сумму 
			|поступления товаров %СуммаЗаказа%'");
			
		Иначе
			
			ТекстОшибки = НСтр("ru = 'Добавление платежа не требуется
			|сумма оплат %СуммаОплаты% превышает 
			|сумму заказа %СуммаЗаказа%'");
						
		КонецЕсли;
		
		ТекстОшибки = СтрЗаменить(ТекстОшибки,"%СуммаОплаты%",СуммаОплаты);
		ТекстОшибки = СтрЗаменить(ТекстОшибки,"%СуммаЗаказа%",СуммаЗаказа);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			,
			"Объект.ЭтапыОплат",
			,
			Отказ);
	
	ИначеЕсли СуммаЗаказа <> 0 И СуммаОплаты = СуммаЗаказа Тогда
				
		Если ДокументПоступленияСуществует Тогда
			
			ТекстОшибки = НСтр("ru = 'Добавление платежа не требуется
			|сумма оплат %СуммаОплаты% соответствует сумме 
			|поступления товаров %СуммаЗаказа%'");
			
		Иначе
			
			ТекстОшибки = НСтр("ru = 'Добавление платежа не требуется
			|сумма оплат %СуммаОплаты% соответствует
			|сумме заказа %СуммаЗаказа%'");
			
		КонецЕсли;
		
		ТекстОшибки = СтрЗаменить(ТекстОшибки,"%СуммаОплаты%",СуммаОплаты);
		ТекстОшибки = СтрЗаменить(ТекстОшибки,"%СуммаЗаказа%",СуммаЗаказа);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			,
			"Объект.ЭтапыОплат",
			,
			Отказ);
		
	ИначеЕсли СуммаЗаказа = 0 Тогда
									
		ТекстОшибки = НСтр("ru = 'Не заданы суммы в табличной части ""Товары""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			,
			"Объект.Товары",
			,
			Отказ);
		
	Иначе
		
		ДатаПоступления = ?(ЭтоЗаказПоставщику, Объект.ДатаПоступления, НачалоДня(Объект.Дата));
		
		СуммаОплаты = СуммаЗаказа - СуммаОплаты;
		
		Если СуммаОплаты <> 0 Тогда
			
			ДатаЭтапаПлатежа = ДатаПоступления;
			
			Если Объект.ЭтапыОплат.Количество() > 0 Тогда
				
				ДатаЭтапаПлатежа = Макс(Объект.ЭтапыОплат[Объект.ЭтапыОплат.Количество()-1].ДатаПлатежа,ДатаПоступления);
				
			КонецЕсли;
			
				
			Если ДатаЭтапаПлатежа = Дата('00010101') Тогда
				
				ТекстОшибки = НСтр("ru = 'Не выбрана дата платежа'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				,
				"Объект",
				,
				Отказ);
				
			Иначе
				
				
				СтрокаЭтапаОплаты = Объект.ЭтапыОплат.Добавить();
				СтрокаЭтапаОплаты.ДатаПлатежа   = ДатаЭтапаПлатежа;
				СтрокаЭтапаОплаты.ПроцентОплаты = ?(СуммаЗаказа = 0, 0, Окр(100*СуммаОплаты/СуммаЗаказа, 2, РежимОкругления.Окр15как20));
				
				Для Инд = 0 По Объект.ЭтапыОплат.Количество() - 2 Цикл
					ЗакупкиКлиент.ПересчитатьСуммуПроцентОплаты(Объект, СуммаЗаказа, Объект.ЭтапыОплат[Инд], Объект.ЭтапыОплат[Инд].Сумма, Истина);
				КонецЦикла;
				
				СтрокаЭтапаОплаты.Сумма = СуммаОплаты;
				СтрокаЭтапаОплаты.Сумма = СтрокаЭтапаОплаты.Сумма + (СуммаЗаказа - Объект.ЭтапыОплат.Итог("Сумма"));
				ВидПлатежа = ПредопределенноеЗначение("Перечисление.ВидПлатежа.ОтсрочкаПлатежа");
				Если Копирование Тогда
					ТекущаяСтрока = Элементы.ЭтапыОплат.ТекущиеДанные;
					Если ТекущаяСтрока <> Неопределено Тогда
						СтрокаЭтапаОплаты.ФормаОплаты = ТекущаяСтрока.ФормаОплаты;
					КонецЕсли;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрокаЭтапаОплаты.ФормаОплаты) Тогда
					СтрокаЭтапаОплаты.ФормаОплаты = ПредопределенноеЗначение("Перечисление.ФормыОплаты.Наличная");
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ДатаПоступления) Тогда
					
					Если ДатаЭтапаПлатежа < ДатаПоступления Тогда
						
						ВидПлатежа = ПредопределенноеЗначение("Перечисление.ВидПлатежа.Предоплата");
						
					Иначе
						
						СтрокаЭтапаОплаты.ОтсрочкаПлатежа = (ДатаЭтапаПлатежа - ДатаПоступления) / 86400;
						
					КонецЕсли;
					
				Иначе
					
					ВидПлатежа = ПредопределенноеЗначение("Перечисление.ВидПлатежа.Предоплата");
					
				КонецЕсли;
				
				СтрокаЭтапаОплаты.ВидПлатежа = ВидПлатежа;
				
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Показывает оповещение пользователя об окончании заполнения этапов оплаты.
//
// Параметры:
// ЦеныРассчитаны - Булево - Признак успешного расчета цен хотя бы в одной строке.
// Магазин - СправочникСсылка.Магазины - Магазин, по которому осуществлялось заполнение цен.
//
Процедура ОповеститьОбОкончанииЗаполненияЭтаповОплаты(Контрагент) Экспорт
	
	ПоказатьОповещениеПользователя(
				НСтр("ru = 'Этапы оплаты заполнены'"),
				,
				СтрЗаменить(НСтр("ru='Этапы оплаты по поставщику ""%Контрагент%"" в документе заполнены'"), "%Контрагент%", Контрагент),
				БиблиотекаКартинок.Информация32
			);
			
КонецПроцедуры

// Процедура пересчитывает процент оплаты и сумму оплаты.
//
// Параметры:
//  СтрокаПересчета  - Строка табличного поля Этапы оплат.
//  ЗначениеПересчета - Число - Значение относительно которого выполняется пересчет.
//  ПересчитатьПроцентОплаты - Булево - Признак что пересчитывается процент оплаты или сумма оплаты.
Процедура ПересчитатьСуммуПроцентОплаты(Объект, СуммаИтог, СтрокаПересчета, ЗначениеПересчета, ПересчитатьПроцентОплаты) Экспорт 
	
	
	ИмяКолонкиПроцент = "ПроцентОплаты";
	
	Если НЕ СуммаИтог = 0 Тогда
		
		Если ПересчитатьПроцентОплаты Тогда
			
			СтрокаПересчета[ИмяКолонкиПроцент] = Окр(100*ЗначениеПересчета/СуммаИтог, 2, РежимОкругления.Окр15как20);
			
		Иначе
			
			СтрокаПересчета.Сумма = Окр(ЗначениеПересчета / 100 * СуммаИтог, 2, РежимОкругления.Окр15как20);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Создает документ "Счет-фактура полученный" с признаком "Исправление" или открывает существующий.
//
// Параметры:
//  Форма - Форма - Форма, из которой вызвана команда. Устанавливается владельцем открываемой формы счета-фактуры;
//  Организация - СправочникСсылка.Организации - Организация, на имя которой оформляется счет-фактура;
//  ОткрыватьСуществующую - Булево - Признак необходимости поиска и открытия формы найденного счета-фактуры;
//  Исправление - Булево - Истина - Создается исправление счета-фактуры;
//  Корректировочный - Булево - Создается корректировочный счет-фактура.
//
Процедура ВвестиСчетФактуру(Форма, Организация, ОткрыватьСуществующую = Ложь, Исправление = Ложь) Экспорт
	
	ВводитьСчетФактуру = Истина;
	
	Если ОткрыватьСуществующую Тогда
		СчетФактураДокумента = ЗакупкиВызовСервера.СчетФактураДокумента(Форма.Объект.Ссылка, Организация, Ложь);
		Если ЗначениеЗаполнено(СчетФактураДокумента) Тогда
			ВводитьСчетФактуру = Ложь;
			
			ПараметрыФормы = Новый Структура("Ключ, ДокументОснование",
				СчетФактураДокумента, Форма.Объект.Ссылка);
			ОткрытьФорму("Документ.СчетФактураПолученный.ФормаОбъекта", ПараметрыФормы, Форма);
		КонецЕсли;
	КонецЕсли;
	
	Если ВводитьСчетФактуру
		И (НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка)
		ИЛИ НЕ Форма.Объект.Проведен
		ИЛИ Форма.Модифицированность) Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", Форма);
		ДополнительныеПараметры.Вставить("Организация", Организация);
		ДополнительныеПараметры.Вставить("Исправление", Исправление);
		ДополнительныеПараметры.Вставить("ОткрыватьСуществующую", ОткрыватьСуществующую);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеВопросНаПроведение", ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = НСтр("ru = 'Ввод счета-фактуры возможен только после проведения документа, провести документ?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		ОткрытьФормуСчетаФактуры(Форма, Организация, ВводитьСчетФактуру, Исправление, ОткрыватьСуществующую);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьФормуСчетаФактуры(Форма, Организация, ВводитьСчетФактуру, Исправление, ОткрыватьСуществующую)
	
	Если ВводитьСчетФактуру И Исправление Тогда
		СчетФактураДокумента = ЗакупкиВызовСервера.СчетФактураДокумента(Форма.Объект.Ссылка, Организация, Ложь);
		Если ЗначениеЗаполнено(СчетФактураДокумента)
				И НЕ ОбщегоНазначенияРТВызовСервера.ЗначениеРеквизитаОбъекта(СчетФактураДокумента, "Проведен") Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'Ввод исправительного счета-фактуры возможен только на основании проведенного счета-фактуры.'"));
			ВводитьСчетФактуру = Ложь;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ВводитьСчетФактуру Тогда
		
		ДанныеСчетаФактуры = Новый Структура;
		ДанныеСчетаФактуры.Вставить("ДокументОснование", Форма.Объект.Ссылка);
		ДанныеСчетаФактуры.Вставить("Организация",       Организация);
		ДанныеСчетаФактуры.Вставить("Исправление",       Исправление);
		ДанныеСчетаФактуры.Вставить("Контрагент",        Форма.Объект.Контрагент);
		Если ОткрыватьСуществующую Тогда
			ДанныеСчетаФактуры.Вставить("ДатаИсправления", Форма.Объект.Дата);
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура("Основание, ДокументОснование",
			ДанныеСчетаФактуры, Форма.Объект.Ссылка);
		ОткрытьФорму("Документ.СчетФактураПолученный.ФормаОбъекта", ПараметрыФормы, Форма);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповещениеВопросНаПроведение(КодОтвета, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	Организация = ДополнительныеПараметры.Организация;
	Исправление = ДополнительныеПараметры.Исправление;
	ОткрыватьСуществующую = ДополнительныеПараметры.ОткрыватьСуществующую;
	
	Если КодОтвета = КодВозвратаДиалога.Да Тогда
		Попытка
			ВводитьСчетФактуру = Форма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		Исключение
			ПоказатьПредупреждение(,НСтр("ru = 'Не удалось выполнить проведение документа'"));
			ВводитьСчетФактуру = Ложь;
			Возврат;
		КонецПопытки;
	Иначе
		ВводитьСчетФактуру = Ложь;
	КонецЕсли;
	
	ОткрытьФормуСчетаФактуры(Форма, Организация, ВводитьСчетФактуру, Исправление, ОткрыватьСуществующую);
	
КонецПроцедуры

#Область КомиссионнаяТорговля

&НаКлиенте
Функция УстановитьДоступностьЭлементовТабличнойЧастиТоварыКлиент(Форма, ТекущиеДанные, ДоступныеЭлементы) Экспорт
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ДоступностьЭлементовСтроки              = Ложь;
	ДоступностьРедактированияНоменклатуры   = Истина;
	ДоступностьРедактированияХарактеристики = Ложь;
	
	Если ТекущиеДанные.Характеристика.Пустая() Тогда
		ДоступностьРедактированияХарактеристики = Истина;
	КонецЕсли;
	
	Элементы.ТоварыНоменклатура.ТолькоПросмотр   = Не ДоступностьРедактированияНоменклатуры;
	Элементы.ТоварыХарактеристика.ТолькоПросмотр = Не ДоступностьРедактированияХарактеристики;
	
	Для каждого ТекущийЭлемент Из ДоступныеЭлементы Цикл      
		Элементы[ТекущийЭлемент].ТолькоПросмотр = ДоступностьЭлементовСтроки;    
	КонецЦикла; 
	
КонецФункции

Функция ЕстьВозможностьЗаполнитьПоГрафикуПоставщика(Параметры) Экспорт
	
	Отказ          = Ложь; 
	ТекстСообщения = НСтр("ru = 'Табличная часть ""%1"" не заполена!'");
	
	
	Если Параметры.ТоварыОтстутствуют Тогда
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1", "Товары" );
		Отказ = Истина;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ТекстСообщения",ТекстСообщения);
	Результат.Вставить("Отказ",         Отказ);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
